app/views/employees/_form.html.erb

SELECT "projects".* FROM "projects"
---
    <%= form.label :project_id %>
    <%= form.collection_select :project_id, Project.all, :id, :name %>

SELECT "employees".* FROM "employees"
---
    <%= form.label :team_lead_id %>
    <%= form.collection_select :team_lead_id, Employee.all, :id, :name, :include_blank => true %>