app/views/employees/subordinates.html.erb

        <td><%= team_mem.name %></td>
        <td><%= team_mem.skills.count %></td>
---
SELECT COUNT(*) FROM "skills" WHERE "skills"."employee_id" = ?  [["employee_id", 3]]