app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)
    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "date_of_joining", "designation", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["date_of_joining", "2017-06-07"], ["designation", ""], ["project_id", 1], ["created_at", "2017-06-07 05:47:10.690636"], ["updated_at", "2017-06-07 05:47:10.690636"]]

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "designation" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["designation", "Sr FSD"], ["updated_at", "2017-06-07 10:52:58.978064"], ["id", 3]]

  def subordinates
    @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]