app/controllers/skills_controller.rb

	def create
		@employee = Employee.find(params[:employee_id])
		@skill = @employee.skills.create(skill_params)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "skills" ("name", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Javascript"], ["employee_id", 3], ["created_at", "2017-06-07 06:56:18.934292"], ["updated_at", "2017-06-07 06:56:18.934292"]]